[
	{
		"name": "Botswana",
        "displayName" : "Botswana",
		"continent" : 1,
		"capital" : "Gaborone",
		"size" : 581730,
		"population" : 2255000,
		"currency" : "Botswana pula",
		"flag": "botswana",
		"languages": [2,12],
		"description": "Botswana is a landlocked country in Southern Africa. Formerly the British protectorate of Bechuanaland, Botswana adopted its name after becoming independent within the Commonwealth on 30 September 1966. Since then, it has been a representative republic, with a consistent record of uninterrupted democratic elections and the lowest perceived corruption ranking in Africa since at least 1998. It is currently Africa's oldest continuous democracy. Botswana is topographically flat, with up to 70 percent of its territory being the Kalahari Desert. It is bordered by South Africa to the south and southeast, Namibia to the west and north, and Zimbabwe to the northeast. Its border with Zambia to the north near Kazungula is poorly defined but is, at most, a few hundred metres long."
	},
	{
		"name": "Nigeria",
        "displayName" : "Nigeria",
		"continent" : 1,
		"capital" : "Abuja",
		"size" : 923768,
		"population" : 201000000,
		"currency" : "Naira",
		"flag": "nigeria",
		"languages": [2],
		"description": "Nigeria is a country in West Africa, bordering Niger in the north, Chad in the northeast, Cameroon in the east, and Benin in the west. Its coast in the south is located on the Gulf of Guinea in the Atlantic Ocean. The federation comprises 36 states and 1 Federal Capital Territory, where the capital, Abuja, is located. The constitution defines Nigeria as a democratic secular state.,[6] Nigeria has been home to a number of ancient and indigenous kingdoms and states over the millennia. The modern state originated from British colonial rule beginning in the 19th century, and took its present territorial shape with the merging of the Southern Nigeria Protectorate and Northern Nigeria Protectorate in 1914 by Lord Fredrick Lugard. The British set up administrative and legal structures while practicing indirect rule through traditional chiefdoms, Nigeria became a formally independent federation in 1960. It experienced a civil war from 1967 to 1970. It thereafter alternated between democratically elected civilian governments and military dictatorships until it achieved a stable democracy in 1999, with the 2011 presidential election considered the first to be reasonably free and fair."
	},
	{
		"name": "South Africa",
        "displayName" : "South Africa",
		"continent" : 1,
		"capital" : "Pretoria",
		"size" : 1221037,
		"population" : 58775000,
		"currency" : "South African rand",
		"flag": "southafrica",
		"languages": [1,2,10,13,14,17,18,19,20,21,22],
		"description": "South Africa is the southernmost country in Africa. It is bounded to the south by 2,798 kilometres (1,739 mi) of coastline of Southern Africa stretching along the South Atlantic and Indian Oceans; to the north by the neighbouring countries of Namibia, Botswana, and Zimbabwe; and to the east and northeast by Mozambique and Eswatini (Swaziland); and it surrounds the enclaved country of Lesotho. South Africa is the largest country in Southern Africa and the 24th-largest country in the world by land area and, with over 58 million people, is also the world's 24th-most populous nation. It is the southernmost country on the mainland of the Old World or the Eastern Hemisphere. About 80 percent of South Africans are of Bantu ancestry, divided among a variety of ethnic groups speaking different African languages, nine of which have official status. The remaining population consists of Africa's largest communities of European, Asian (Indian), and multiracial (Coloured) ancestry."
	},
    {
        "name": "Argentina",
        "displayName" : "Argentina",
        "continent" : 2,
        "capital" : "Buenos Aires",
        "size" : 2780400,
        "population" : 45000000,
        "currency" : "Argentinian peso",
        "flag": "argentina",
        "languages": [15],
        "description": "Argentina is a country located mostly in the southern half of South America. Sharing the bulk of the Southern Cone with Chile to the west, the country is also bordered by Bolivia and Paraguay to the north, Brazil to the northeast, Uruguay and the South Atlantic Ocean to the east, and the Drake Passage to the south. With a mainland area of 2,780,400 km2 (1,073,500 sq mi), Argentina is the eighth-largest country in the world, the fourth largest in the Americas, the second largest in South America after Brazil, and the largest Spanish-speaking nation. The sovereign state is subdivided into twenty-three provinces (Spanish: provincias, singular provincia) and one autonomous city (ciudad autónoma), Buenos Aires, which is the federal capital of the nation (Spanish: Capital Federal) as decided by Congress. The provinces and the capital have their own constitutions, but exist under a federal system. Argentina claims sovereignty over part of Antarctica, the Falkland Islands (Spanish: Islas Malvinas), and South Georgia and the South Sandwich Islands."
    },
	{
		"name": "Canada",
        "displayName" : "Canada",
		"continent" : 2,
		"capital" : "Ottawa",
		"size" : 9984670,
		"population" : 37800000,
		"currency" : "Canadian dollar",
		"flag": "canada",
		"languages": [2,3],
		"description": "Canada is a country in the northern part of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering 9.98 million square kilometres (3.85 million square miles), making it the world's second-largest country by total area. Its southern border with the United States, stretching some 8,891 kilometres (5,525 mi), is the world's longest bi-national land border. Canada's capital is Ottawa, and its three largest metropolitan areas are Toronto, Montreal, and Vancouver."
	},
	{
		"name": "Chile",
        "displayName" : "Chile",
		"continent" : 2,
		"capital" : "Santiago",
		"size" : 756096,
		"population" : 17575000,
		"currency" : "Chilian peso",
		"flag": "chile",
		"languages": [15],
		"description": "Chile is a South American country occupying a long, narrow strip of land between the Andes to the east and the Pacific Ocean to the west. It borders Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage in the far south. Chilean territory includes the Pacific islands of Juan Fernández, Salas y Gómez, Desventuradas, and Easter Island in Oceania. Chile also claims about 1,250,000 square kilometres (480,000 sq mi) of Antarctica under the Chilean Antarctic Territory., The arid Atacama Desert in northern Chile contains great mineral wealth, principally copper and lithium. The relatively small central area dominates in terms of population and agricultural resources, and is the cultural and political center from which Chile expanded in the late 19th century when it incorporated its northern and southern regions. Southern Chile is rich in forests and grazing lands, and features a string of volcanoes and lakes. The southern coast is a labyrinth of fjords, inlets, canals, twisting peninsulas, and islands."
	},
	{
		"name": "Colombia",
        "displayName" : "Colombia",
		"continent" : 2,
		"capital" : "Bogota",
		"size" : 1141748,
		"population" : 48260000,
		"currency" : "Colombian peso",
		"flag": "colombia",
		"languages": [15],
		"description": "Colombia is a country largely situated in the north of South America, with land and territories in North America. Colombia is bounded on the north by the Caribbean Sea, the northwest by Panama, the south by both Ecuador and Peru, the east by Venezuela, the southeast by Brazil, and the west by the Pacific. It comprises thirty-two departments, with the capital in Bogotá."
	},
	{
		"name": "United States of America",
        "displayName" : "USA",
		"continent" : 2,
		"capital" : "Washington, D.C.",
		"size" : 9833520,
		"population" : 328240000,
		"currency" : "United States dollar",
		"flag": "us",
		"languages": [2],
		"description": "The United States of America (USA), commonly known as the United States (U.S. or US) or America, is a country consisting of 50 states, a federal district, five major self-governing territories, and various possessions.[g] At 3.8 million square miles (9.8 million km2), it is the world's third or fourth-largest country by total area[b] and is slightly smaller than the entire continent of Europe. Most of the country is located in central North America between Canada and Mexico. With an estimated population of over 328 million, the U.S. is the third most populous country in the world. The capital is Washington, D.C., and the most populous city is New York City."
	},
    {
        "name": "Uruguay",
        "displayName" : "Uruguay",
        "continent" : 2,
        "capital" : "Montevideo",
        "size" : 176215,
        "population" : 3450000,
        "currency" : "Uruguayan peso",
        "flag": "uruguay",
        "languages": [15],
        "description": "Uruguay is a country in the southeastern region of South America. It borders Argentina to its west and Brazil to its north and east, with the Río de la Plata (River of Silver) to the south and the Atlantic Ocean to the southeast. Uruguay is home to an estimated 3.45 million people, of whom 1.8 million live in the metropolitan area of its capital and largest city, Montevideo. With an area of approximately 176,000 square kilometers (68,000 sq mi), Uruguay is geographically the second-smallest nation in South America, after Suriname."
    },
	{
		"name": "China",
        "displayName" : "China",
		"continent" : 3,
		"capital" : "Beijing",
		"size" : 9596961,
		"population" : 1427650000,
		"currency" : "Renminbi",
		"flag": "china",
		"languages": [16],
		"description": "China is a country in East Asia and is the world's most populous country, with a population of around 1.428 billion in 2017. Covering approximately 9,600,000 square kilometers (3,700,000 sq mi), it is the third largest country by area. Governed by the Communist Party of China, the state exercises jurisdiction over 22 provinces, five autonomous regions, four direct-controlled municipalities (Beijing, Tianjin, Shanghai, and Chongqing), and the special administrative regions of Hong Kong and Macau."
	},
	{
		"name": "Russia",
        "displayName" : "Russia",
		"continent" : 3,
		"capital" : "Moscow",
		"size" : 17125200,
		"population" : 146745000,
		"currency" : "Russian ruble",
		"flag": "russia",
		"languages": [11],
		"description": "Russia is a European country located in Eastern Europe with a vast expanse of territory that stretches across Northern Asia. At 17,125,200 square kilometres (6,612,100 sq mi), it is by far the largest country in the world by area, covering more than one-eighth of the Earth's inhabited land area,spanning eleven time zones, and bordering 16 sovereign nations. The territory of Russia extends from the Baltic Sea in the west to the Pacific Ocean in the east, and from the Arctic Ocean in the north to the Black Sea and the Caucasus in the south. With 146.7 million inhabitants living in the country's 85 federal subjects as of 2020, Russia is the most populous nation in Europe and the ninth-most populous nation in the world. Russia's capital and largest city is Moscow; other major urban areas include Saint Petersburg, Novosibirsk, Yekaterinburg, Nizhny Novgorod, Kazan and Chelyabinsk."
	},
	{
		"name": "South Korea",
        "displayName" : "South Korea",
		"continent" : 3,
		"capital" : "Seoul",
		"size" : 100363,
		"population" : 51710000,
		"currency" : "Korean Republic won",
		"flag": "southkorea",
		"languages": [6,7],
		"description": "South Korea is a country in East Asia, constituting the southern part of the Korean Peninsula and sharing a land border with North Korea. The name Korea is derived from Goguryeo, which was one of the great powers in East Asia during its time, ruling most of the Korean Peninsula, Manchuria, parts of the Russian Far East and Inner Mongolia under Gwanggaeto the Great. Its capital, Seoul, is a major global city and half of South Korea's over 51 million people live in the Seoul Capital Area, the fourth largest metropolitan economy in the world."
	},
	{
		"name": "Australia",
        "displayName" : "Australia",
		"continent" : 4,
		"capital" : "Canberra",
		"size" : 7692024,
		"population" : 25638600,
		"currency" : "Australian dollar",
		"flag": "australia",
		"languages": [2],
		"description": "Australia, officially the Commonwealth of Australia, is a sovereign country comprising the mainland of the Australian continent, the island of Tasmania, and numerous smaller islands. It is the largest country in Oceania and the world's sixth-largest country by total area. The population of 26 million is highly urbanised and heavily concentrated on the eastern seaboard.Australia's capital is Canberra, and its largest city is Sydney. The country's other major metropolitan areas are Melbourne, Brisbane, Perth, and Adelaide."
	},
	{
		"name": "New Zealand",
        "displayName" : "New Zealand",
		"continent" : 4,
		"capital" : "Wellington",
		"size" : 268021,
		"population" : 4970000,
		"currency" : "New Zealand dollar",
		"flag": "newzealand",
		"languages": [2,8,9],
		"description": "New Zealand is a sovereign island country in the southwestern Pacific Ocean. The country has two main landmasses—the North Island (Te Ika-a-Māui), and the South Island (Te Waipounamu)—and around 600 smaller islands. It has a total land area of 268,000 square kilometres (103,500 sq mi). New Zealand is about 2,000 kilometres (1,200 mi) east of Australia across the Tasman Sea and 1,000 kilometres (600 mi) south of the Pacific island areas of New Caledonia, Fiji, and Tonga. Because of its remoteness, it was the last large habitable landmass to be settled by humans. During its long period of isolation, New Zealand developed a distinct biodiversity of animal, fungal, and plant life. The country's varied topography and its sharp mountain peaks, such as the Southern Alps, owe much to the tectonic uplift of land and volcanic eruptions. New Zealand's capital city is Wellington, and its most populous city is Auckland."
	},
	{
		"name": "France",
        "displayName" : "France",
		"continent" : 5,
		"capital" : "Paris",
		"size" : 640679,
		"population" : 67025000,
		"currency" : "Euro",
		"flag": "france",
		"languages": [3],
		"description": "France is a country whose territory consists of metropolitan France in Western Europe and several overseas regions and territories. The metropolitan area of France extends from the Mediterranean Sea to the English Channel and the North Sea, and from the Rhine to the Atlantic Ocean. It is bordered by Belgium, Luxembourg and Germany to the northeast, Switzerland and Italy to the east, and Andorra and Spain to the south. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian oceans. The country's 18 integral regions (five of which are situated overseas) span a combined area of 643,801 square kilometres (248,573 sq mi) and a total population of 67.02 million (as of July 2019).France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice. France, including its overseas territories, has the most number of time zones of any country, with a total of 12."
	},
	{
		"name": "Germany",
        "displayName" : "Germany",
		"continent" : 5,
		"capital" : "Berlin",
		"size" : 357386,
		"population" : 83150000,
		"currency" : "Euro",
		"flag": "germany",
		"languages": [4],
		"description": "Germany is a country in Central and Western Europe. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, France to the southwest, and Luxembourg, Belgium, and the Netherlands to the west. Germany includes 16 constituent states, covers an area of 357,386 square kilometres (137,988 sq mi), and has a largely temperate seasonal climate. With 83 million inhabitants, it is the second most populous state of Europe after Russia, the most populous state lying entirely in Europe, as well as the most populous member state of the European Union. Germany is a very decentralised country. Its capital and largest metropolis is Berlin, while Frankfurt serves as its financial capital and has the country's busiest airport."
	},
	{
		"name": "Republic of Ireland",
        "displayName" : "Republic of Ireland",
		"continent" : 5,
		"capital" : "Dublin",
		"size" : 70273,
		"population" : 4920000,
		"currency" : "Euro",
		"flag": "ireland",
		"languages": [5,2],
		"description": "The Republic of Ireland is a country in north-western Europe occupying 26 of 32 counties of the island of Ireland. The capital and largest city is Dublin, which is located on the eastern side of the island. Around a third of the country's population of 4.9 million people resides in the greater Dublin area. The sovereign state shares its only land border with Northern Ireland, a part of the United Kingdom. It is otherwise surrounded by the Atlantic Ocean, with the Celtic Sea to the south, St George's Channel to the south-east, and the Irish Sea to the east. It is a unitary, parliamentary republic. The legislature, the Oireachtas, consists of a lower house, Dáil Éireann, an upper house, Seanad Éireann, and an elected President (Uachtarán) who serves as the largely ceremonial head of state, but with some important powers and duties. The head of government is the Taoiseach (Prime Minister, literally 'Chief', a title not used in English), who is elected by the Dáil and appointed by the President; the Taoiseach in turn appoints other government ministers."
	},
	{
		"name": "Spain",
        "displayName" : "Spain",
		"continent" : 5,
		"capital" : "Madrid",
		"size" : 505990,
		"population" : 46735000,
		"currency" : "Euro",
		"flag": "spain",
		"languages": [15],
		"description": "Spain is a country in Southwestern Europe with some pockets of Spanish territory across the Strait of Gibraltar and the Atlantic Ocean. Its continental European territory is situated on the Iberian Peninsula. Its territory also includes two archipelagoes: the Canary Islands off the coast of Africa, and the Balearic Islands in the Mediterranean Sea. The African enclaves of Ceuta, Melilla, and Peñón de Vélez de la Gomera make Spain the only European country to have a physical border with an African country (Morocco). Several small islands in the Alboran Sea are also part of Spanish territory. The country's mainland is bordered to the south and east by the Mediterranean Sea except for a small land boundary with Gibraltar; to the north and northeast by France, Andorra, and the Bay of Biscay; and to the west and northwest by Portugal and the Atlantic Ocean."
	},
	{
		"name": "United Kingdom of Great Britain and Northern Ireland",
        "displayName" : "United Kingdom",
		"continent" : 5,
		"capital" : "London",
		"size" : 242249,
		"population" : 67545000,
		"currency" : "Pound sterling",
		"flag": "uk",
		"languages": [2],
		"description": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK or U.K.) or Britain, is a sovereign country located off the north­western coast of the European mainland. The United Kingdom includes the island of Great Britain, the north­eastern part of the island of Ireland, and many smaller islands. Northern Ireland shares a land border with the Republic of Ireland. Otherwise, the United Kingdom is surrounded by the Atlantic Ocean, with the North Sea to the east, the English Channel to the south and the Celtic Sea to the southwest, giving it the 12th-longest coastline in the world. The Irish Sea separates Great Britain and Ireland. The total area of the United Kingdom is 94,000 square miles (240,000 km2)."
	},
]
